Revit 2026 API

# FramingShapeClassification Enumeration

---

This enumeration is used to classify MEP Ancillary Framing shape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FramingShapeClassification
```
```vb
Public Enumeration FramingShapeClassification
```
```cpp
public enum class FramingShapeClassification
```
```fsharp
type FramingShapeClassification
```

| Member name | Value | Description |
| --- | --- | --- |
| Circular | 1 |  |
| Linear | 0 |  |
| Other | 3 |  |
| Oval | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace